## Condition

```
Используя дерево отрезков решите следующую задачу.
(110) Есть массив, содержащий 100000 элементов, первоначально все элементы равны 0. В массиве производятся изменения элементов и требуется находить суммы части массива с i
-го по j
-ый элементы.
В первой строке содержится число K
 (1≤K≤50000
) -- количество запросов. Далее следует K
 строк, в каждой строке содержится либо команда "S i
 v
", где 1≤i≤100000
, −100≤v≤100
, заменяющая значение i
-го элемента массива на v
, либо команда "Q i
 j
", где 1≤i≤j≤100000
, требующая вывести сумму части массива с i
-го по j
-ый элементы.
Для каждой команды 'Q' вывести на отдельной строке результат запроса


```

### Implementation

```
vector<int> segmentTree(400000, 0);


long long sum(int vertex, int i, int j, int l, int r) {
    if (i > r || j < l) {
        return 0;
    }
    if (i >= l && j <= r) {
        return segmentTree[vertex];
    }
    long long int mid = (j + i) / 2;
    return sum(2 * vertex + 1, i, mid, l, r) + sum(2 * vertex + 2, mid + 1, j, l, r);
}



void update(int vertex, int l, int r, int position, int value) {
    if (l == r){
        segmentTree[vertex] = value;
    }
    else{
        int mid = (r + l) / 2;
        if(position <= mid){
            update(2 * vertex + 1, l, mid, position, value);
        }
        else{
            update(2 * vertex + 2, mid + 1, r, position, value);
        }
        segmentTree[vertex] = segmentTree[2 * vertex + 1] + segmentTree[2 * vertex + 2];
    }
}
```

### Testing

```
int main() {
    int K;
    cin >> K;

    for (int k = 0; k < K; ++k) {
        char command;
        cin >> command;

        if (command == 'S') {
            int i, v;
            cin >> i >> v;
            update(0, 1, 100000, i, v);
        } else if (command == 'Q') {
            int i, j;
            cin >> i >> j;
            cout << sum(0, 1, 100000, i, j) << endl;
        }
    }
}
```

### Outputs
```
Input: 
5
S 1 100
S 5 10
Q 5 10
S 5 -1
Q 1 100000

Output: 
10
99

Expected output:
10
99
```